Linn39403/STM32NES/stm32nes/Src/GLCD_SPI_STM32F429I.c
/*-----------------------------------------------------------------------------
 * Name:    GLCD_SPI_STM32F429I.c
 * Purpose: low level Graphic LCD (320x240 pixels) ILI9341
 *          with SPI interface
 *-----------------------------------------------------------------------------
 * This file is part of the uVision/ARM development tools.
 * This software may only be used under the terms of a valid, current,
 * end user licence from KEIL for a compatible version of KEIL software
 * development tools. Nothing else gives you the right to use this software.
 *
 * This software is supplied "AS IS" without warranties of any kind.
 *
 * Copyright (c) 2010-2014 KEIL - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------*/

#include "stm32f4xx.h"                  /* STM32F4xx Definitions              */
#include "GLCD.h"
#include "Font_6x8_h.h"
#include "Font_16x24_h.h"

/************************** Orientation  configuration ************************/

#ifndef LANDSCAPE
#define LANDSCAPE   1                   /* 1 for landscape, 0 for portrait    */
#endif
#ifndef ROTATE180
#define ROTATE180   0                   /* 1 to rotate the screen for 180 deg */
#endif

/*********************** Hardware specific configuration **********************/

/* SPI Interface: SPI5

   PINS:
   - CS     = PC2  (GPIO pin)
   - WRX    = PD13 (GPIO pin)
   - SCK    = PF7  (SPI5_SCK)
   - SDO    = PF8  (SPI5_MISO)
   - SDI    = PF9  (SPI5_MOSI)                                                */

#define PIN_CS      (1UL << 2)
#define PIN_WRX     (1UL <<13)

/*------------------------- Speed dependant settings -------------------------*/

/* If processor works on high frequency delay has to be increased, it can be
   increased by factor 2^N by this constant                                   */
#define DELAY_2N    14

/*---------------------- Graphic LCD size definitions ------------------------*/

#if (LANDSCAPE == 1)
#define WIDTH       320                 /* Screen Width (in pixels)           */
#define HEIGHT      240                 /* Screen Hight (in pixels)           */
#else
#define WIDTH       240                 /* Screen Width (in pixels)           */
#define HEIGHT      320                 /* Screen Hight (in pixels)           */
#endif
#define BPP         16                  /* Bits per pixel                     */
#define BYPP        ((BPP+7)/8)         /* Bytes per pixel                    */

/*--------------- Graphic LCD interface hardware definitions -----------------*/

/* Pin CS setting to 0 or 1                                                   */
#define LCD_CS(x)    ((x) ? (GPIOC->BSRRL = PIN_CS)  : (GPIOC->BSRRH = PIN_CS) );
#define LCD_WRX(x)   ((x) ? (GPIOD->BSRRL = PIN_WRX) : (GPIOD->BSRRH = PIN_WRX));

#define BG_COLOR  0                     /* Background color                   */
#define TXT_COLOR 1                     /* Text color                         */


/*---------------------------- Global variables ------------------------------*/

/******************************************************************************/
static volatile unsigned short Color[2] = {White, Black};

#if (LANDSCAPE == 0)
static unsigned int  scroll;
#endif

/************************ Local auxiliary functions ***************************/

/*******************************************************************************
* Delay in while loop cycles                                                   *
*   Parameter:    cnt:    number of while cycles to delay                      *
*   Return:                                                                    *
*******************************************************************************/

static void delay (int cnt) {
  cnt <<= DELAY_2N;
  while (cnt--) __NOP();
}


/*******************************************************************************
* Transfer 1 byte over the serial communication                                *
*   Parameter:    byte:   byte to be sent                                      *
*   Return:               byte read while sending                              *
*******************************************************************************/

static __inline unsigned char spi_tran (unsigned char byte) {

  SPI5->DR = byte;
  while (!(SPI5->SR & SPI_SR_RXNE));

  return (SPI5->DR);
}


/*******************************************************************************
* Write a command the LCD controller                                           *
*   Parameter:    cmd:    command to be written                                *
*   Return:                                                                    *
*******************************************************************************/

static __inline void wr_cmd (unsigned char cmd) {

  LCD_WRX(0);                           /* set WRX to Command                 */
  LCD_CS(0);                            /* set ChipSelect to Active           */
  spi_tran(cmd);                        /* transmit command                   */
  LCD_CS(1);                            /* set ChipSelect to Inactive         */
}


/*******************************************************************************
* Write data to the LCD controller                                             *
*   Parameter:    dat:    data to be written                                   *
*   Return:                                                                    *
*******************************************************************************/

static __inline void wr_dat (unsigned short dat) {

  LCD_WRX(1);                           /* set WRX to Data                    */
  LCD_CS(0);                            /* set ChipSelect to Active           */
  spi_tran(dat);                        /* transmit data                      */
  LCD_CS(1);                            /* set ChipSelect to Inactive         */
}


/*******************************************************************************
* Start of data writing to the LCD controller                                  *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/

static __inline void wr_dat_start (void) {

  LCD_WRX(1);                           /* set WRX to Data                    */
  LCD_CS(0);                            /* set ChipSelect to Active           */
}


