Linn39403/STM32NES/stm32nes/Src/GLCD_SPI_STM32F429I.c
/*******************************************************************************
* Stop of data writing to the LCD controller                                   *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/

static __inline void wr_dat_stop (void) {

  LCD_CS(1);                            /* set ChipSelect to Inactive         */
}


/*******************************************************************************
* Data writing to the LCD controller                                           *
*   Parameter:    dat:    data to be written                                   *
*   Return:                                                                    *
*******************************************************************************/

static __inline void wr_dat_only (unsigned short dat) {

    spi_tran(((dat  ) >> 8) & 0xFF);
    spi_tran(((dat  )     ) & 0xFF);
}


/*******************************************************************************
* Read data from the LCD controller                                            *
*   Parameter:                                                                 *
*   Return:               read data                                            *
*******************************************************************************/
// not yet supported
//static __inline unsigned short rd_dat (void) {
//  unsigned short val = 0;
//
//  LCD_CS(0);
//  spi_tran(0);                                /* Dummy read 1                 */
//  val   = spi_tran(0);                        /* Read D8..D15                 */
//  val <<= 8;
//  val  |= spi_tran(0);                        /* Read D0..D7                  */
//  LCD_CS(1);
//
//  return (val);
//}


/*******************************************************************************
* Write a value to the to LCD register                                         *
*   Parameter:    reg:    register to be written                               *
*                 val:    value to write to the register                       *
*******************************************************************************/

static __inline void wr_reg (unsigned char reg, unsigned short val) {

  wr_cmd(reg);
  wr_dat(val);
}


/*******************************************************************************
* Read from the LCD register                                                   *
*   Parameter:    reg:    register to be read                                  *
*   Return:               value read from the register                         *
*******************************************************************************/
// not yet supported
//static unsigned short rd_reg (unsigned char reg) {

//  wr_cmd(reg);
//  return(rd_dat());
//}


/************************ Exported functions **********************************/

/*******************************************************************************
* Initialize the Graphic LCD controller (ILI9341)                              *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_Initialize (void) {

#if (LANDSCAPE == 0)
  scroll = 0;
#endif


/*--------------------------------------------------------------
   Configures GLCD (ILI9341)  I/Os pins

        G2:  PA6      B2:  PD6      R2:  PC10     HSYNC:           PC6
        G3:  PG10     B3:  PG11     R3:  PB0      VSYNC:           PA4
        G4:  PB10     B4:  PG12     R4:  PA11     DE (Enable):     PF10
        G5:  PB11     B5:  PA3      R5:  PA12     CLK:             PG7
        G6:  PC7      B6:  PB8      R6:  PB1      WRX (CMD/DATA):  PD13
        G7:  PD3      B7:  PB9      R7:  PG6      SPI_CS:          PC2
  --------------------------------------------------------------*/

  /* configure WRX-Pin        */
  RCC->AHB1ENR  |= ((RCC_AHB1ENR_GPIODEN) );   /* Enable GPIOD clock          */
  GPIOD->MODER   &= ~(( 3UL << (2*13))  );
  GPIOD->MODER   |=  (( 1UL << (2*13))  );     /* General purpose output mode */
  GPIOD->OSPEEDR &= ~(( 3UL << (2*13))  );
  GPIOD->OSPEEDR |=  (( 2UL << (2*13))  );     /* 50 MHz Fast speed           */
  GPIOD->OTYPER  &= ~(( 1UL << (1*13))  );     /* Output push-pull            */
  GPIOD->PUPDR   &= ~(( 3UL << (2*13))  );     /* No pull-up, pull-down       */

  /* configure ChipSelect-Pin */
  RCC->AHB1ENR  |= ((RCC_AHB1ENR_GPIOCEN) );   /* Enable GPIOC clock          */
  GPIOC->MODER   &= ~(( 3UL << (2* 2))  );
  GPIOC->MODER   |=  (( 1UL << (2* 2))  );     /* General purpose output mode */
  GPIOC->OSPEEDR &= ~(( 3UL << (2* 2))  );
  GPIOC->OSPEEDR |=  (( 2UL << (2* 2))  );     /* 50 MHz Fast speed           */
  GPIOC->OTYPER  &= ~(( 1UL << (1* 2))  );     /* Output push-pull            */
  GPIOC->PUPDR   &= ~(( 3UL << (2* 2))  );     /* No pull-up, pull-down       */

  LCD_CS(1);

  /* configure GLCD pins (set to LOW (not used) */
  RCC->AHB1ENR  |= ((RCC_AHB1ENR_GPIOAEN) |    /* Enable GPIOA clock          */
                    (RCC_AHB1ENR_GPIOBEN) |    /* Enable GPIOA clock          */
                    (RCC_AHB1ENR_GPIOCEN) |    /* Enable GPIOC clock          */
                    (RCC_AHB1ENR_GPIODEN) |    /* Enable GPIOD clock          */
                    (RCC_AHB1ENR_GPIOFEN) |    /* Enable GPIOF clock          */
                    (RCC_AHB1ENR_GPIOGEN)  );  /* Enable GPIOG clock          */

  GPIOA->BSRRH    =  (( 1UL << (1* 3)) |
                      ( 1UL << (1* 4)) |
                      ( 1UL << (1* 6)) |
                      ( 1UL << (1*11)) |
                      ( 1UL << (1*12))  );     /* set Pins to low             */
  GPIOA->MODER   &= ~(( 3UL << (2* 3)) |
                      ( 3UL << (2* 4)) |
                      ( 3UL << (2* 6)) |
                      ( 3UL << (2*11)) |
                      ( 3UL << (2*12))  );
  GPIOA->MODER   |=  (( 1UL << (2* 3)) |
                      ( 1UL << (2* 4)) |
                      ( 1UL << (2* 6)) |
                      ( 1UL << (2*11)) |
                      ( 1UL << (2*12))  );     /* General purpose output mode */
  GPIOA->OSPEEDR &= ~(( 3UL << (2* 3)) |
                      ( 3UL << (2* 4)) |
                      ( 3UL << (2* 6)) |
                      ( 3UL << (2*11)) |
                      ( 3UL << (2*12))  );
  GPIOA->OSPEEDR |=  (( 2UL << (2* 3)) |
                      ( 2UL << (2* 4)) |
                      ( 2UL << (2* 6)) |
                      ( 2UL << (2*11)) |
                      ( 2UL << (2*12))  );     /* 50 MHz Fast speed           */
  GPIOA->OTYPER  &= ~(( 1UL << (1* 3)) |
                      ( 1UL << (1* 4)) |
                      ( 1UL << (1* 6)) |
                      ( 1UL << (1*11)) |
                      ( 1UL << (1*12))  );     /* Output push-pull            */
  GPIOA->PUPDR   &= ~(( 3UL << (2* 3)) |
                      ( 3UL << (2* 4)) |
                      ( 3UL << (2* 6)) |
                      ( 3UL << (2*11)) |
                      ( 3UL << (2*12))  );     /* No pull-up, pull-down       */

