Linn39403/STM32NES/stm32nes/Src/GLCD_SPI_STM32F429I.c
  GPIOB->BSRRH    =  (( 1UL << (1* 0)) |
                      ( 1UL << (1* 1)) |
                      ( 1UL << (1* 8)) |
                      ( 1UL << (1* 9)) |
                      ( 1UL << (1*10)) |
                      ( 1UL << (1*11))  );     /* set Pins to low             */
  GPIOB->MODER   &= ~(( 3UL << (2* 0)) |
                      ( 3UL << (2* 1)) |
                      ( 3UL << (2* 8)) |
                      ( 3UL << (2* 9)) |
                      ( 3UL << (2*10)) |
                      ( 3UL << (2*11))  );
  GPIOB->MODER   |=  (( 1UL << (2* 0)) |
                      ( 1UL << (2* 1)) |
                      ( 1UL << (2* 8)) |
                      ( 1UL << (2* 9)) |
                      ( 1UL << (2*10)) |
                      ( 1UL << (2*11))  );     /* General purpose output mode */
  GPIOB->OSPEEDR &= ~(( 3UL << (2* 0)) |
                      ( 3UL << (2* 1)) |
                      ( 3UL << (2* 8)) |
                      ( 3UL << (2* 9)) |
                      ( 3UL << (2*10)) |
                      ( 3UL << (2*11))  );
  GPIOB->OSPEEDR |=  (( 2UL << (2* 0)) |
                      ( 2UL << (2* 1)) |
                      ( 2UL << (2* 8)) |
                      ( 2UL << (2* 9)) |
                      ( 2UL << (2*10)) |
                      ( 2UL << (2*11))  );     /* 50 MHz Fast speed           */
  GPIOB->OTYPER  &= ~(( 1UL << (1* 0)) |
                      ( 1UL << (1* 1)) |
                      ( 1UL << (1* 8)) |
                      ( 1UL << (1* 9)) |
                      ( 1UL << (1*10)) |
                      ( 1UL << (1*11))  );     /* Output push-pull            */
  GPIOB->PUPDR   &= ~(( 3UL << (2* 0)) |
                      ( 3UL << (2* 1)) |
                      ( 3UL << (2* 8)) |
                      ( 3UL << (2* 9)) |
                      ( 3UL << (2*10)) |
                      ( 3UL << (2*11))  );     /* No pull-up, pull-down       */

  GPIOC->BSRRH    =  (( 1UL << (1* 6)) |
                      ( 1UL << (1* 7)) |
                      ( 1UL << (1*10))  );     /* set Pins to low             */
  GPIOC->MODER   &= ~(( 3UL << (2* 6)) |
                      ( 3UL << (2* 7)) |
                      ( 3UL << (2*10))  );
  GPIOC->MODER   |=  (( 1UL << (2* 6)) |
                      ( 1UL << (2* 7)) |
                      ( 1UL << (2*10))  );     /* General purpose output mode */
  GPIOC->OSPEEDR &= ~(( 3UL << (2* 6)) |
                      ( 3UL << (2* 7)) |
                      ( 3UL << (2*10))  );
  GPIOC->OSPEEDR |=  (( 2UL << (2* 6)) |
                      ( 2UL << (2* 7)) |
                      ( 2UL << (2*10))  );     /* 50 MHz Fast speed           */
  GPIOC->OTYPER  &= ~(( 1UL << (1* 6)) |
                      ( 1UL << (1* 7)) |
                      ( 1UL << (1*10))  );     /* Output push-pull            */
  GPIOC->PUPDR   &= ~(( 3UL << (2* 6)) |
                      ( 3UL << (2* 7)) |
                      ( 3UL << (2*10))  );     /* No pull-up, pull-down       */

  GPIOD->BSRRH    =  (( 1UL << (1* 3)) |
                      ( 1UL << (1* 6))  );     /* set Pins to low             */
  GPIOD->MODER   &= ~(( 3UL << (2* 3)) |
                      ( 3UL << (2* 6))  );
  GPIOD->MODER   |=  (( 1UL << (2* 3)) |
                      ( 1UL << (2* 6))  );     /* General purpose output mode */
  GPIOD->OSPEEDR &= ~(( 3UL << (2* 3)) |
                      ( 3UL << (2* 6))  );
  GPIOD->OSPEEDR |=  (( 2UL << (2* 3)) |
                      ( 2UL << (2* 6))  );     /* 50 MHz Fast speed           */
  GPIOD->OTYPER  &= ~(( 1UL << (1* 3)) |
                      ( 1UL << (1* 6))  );     /* Output push-pull            */
  GPIOD->PUPDR   &= ~(( 3UL << (2* 3)) |
                      ( 3UL << (2* 6))  );     /* No pull-up, pull-down       */

  GPIOF->BSRRH    =  (( 1UL << (1*10))  );     /* set Pins to low             */
  GPIOF->MODER   &= ~(( 3UL << (2*10))  );
  GPIOF->MODER   |=  (( 1UL << (2*10))  );     /* General purpose output mode */
  GPIOF->OSPEEDR &= ~(( 3UL << (2*10))  );
  GPIOF->OSPEEDR |=  (( 2UL << (2*10))  );     /* 50 MHz Fast speed           */
  GPIOF->OTYPER  &= ~(( 1UL << (1*10))  );     /* Output push-pull            */
  GPIOF->PUPDR   &= ~(( 3UL << (2*10))  );     /* No pull-up, pull-down       */

  GPIOG->BSRRH    =  (( 1UL << (1* 6)) |
                      ( 1UL << (1* 7)) |
                      ( 1UL << (1*10)) |
                      ( 1UL << (1*11)) |
                      ( 1UL << (1*12))  );     /* set Pins to low             */
  GPIOG->MODER   &= ~(( 3UL << (2* 6)) |
                      ( 3UL << (2* 7)) |
                      ( 3UL << (2*10)) |
                      ( 3UL << (2*11)) |
                      ( 3UL << (2*12))  );
  GPIOG->MODER   |=  (( 1UL << (2* 6)) |
                      ( 1UL << (2* 7)) |
                      ( 1UL << (2*10)) |
                      ( 1UL << (2*11)) |
                      ( 1UL << (2*12))  );     /* General purpose output mode */
  GPIOG->OSPEEDR &= ~(( 3UL << (2* 6)) |
                      ( 3UL << (2* 7)) |
                      ( 3UL << (2*10)) |
                      ( 3UL << (2*11)) |
                      ( 3UL << (2*12))  );
  GPIOG->OSPEEDR |=  (( 2UL << (2* 6)) |
                      ( 2UL << (2* 7)) |
                      ( 2UL << (2*10)) |
                      ( 2UL << (2*11)) |
                      ( 2UL << (2*12))  );     /* 50 MHz Fast speed           */
  GPIOG->OTYPER  &= ~(( 1UL << (1* 6)) |
                      ( 1UL << (1* 7)) |
                      ( 1UL << (1*10)) |
                      ( 1UL << (1*11)) |
                      ( 1UL << (1*12))  );     /* Output push-pull            */
  GPIOG->PUPDR   &= ~(( 3UL << (2* 6)) |
                      ( 3UL << (2* 7)) |
                      ( 3UL << (2*10)) |
                      ( 3UL << (2*11)) |
                      ( 3UL << (2*12))  );     /* No pull-up, pull-down       */




  // Configure SPI  pins
  RCC->AHB1ENR  |= ((RCC_AHB1ENR_GPIOFEN)  );  /* Enable GPIOF clock          */

  GPIOF->AFR[0]  &= ~((15UL << (4* 7)) );
  GPIOF->AFR[0]  |=  (( 5UL << (4* 7)) );      /* Alternate Function mode AF5 */
  GPIOF->AFR[1]  &= ~((15UL << (4* 0)) |
                      (15UL << (4* 1))  );
  GPIOF->AFR[1]  |=  (( 5UL << (4* 0)) |
                      ( 5UL << (4* 1))  );     /* Alternate Function mode AF5 */
  GPIOF->MODER   &= ~(( 3UL << (2* 7)) |
                      ( 3UL << (2* 8)) |
                      ( 3UL << (2* 9))  );
  GPIOF->MODER   |=  (( 2UL << (2* 7)) |
                      ( 2UL << (2* 8)) |
                      ( 2UL << (2* 9))  );     /* Alternate Function mode     */
  GPIOF->OSPEEDR &= ~(( 3UL << (2* 7)) |
                      ( 3UL << (2* 8)) |
                      ( 3UL << (2* 9))  );
  GPIOF->OSPEEDR |=  (( 3UL << (2* 7)) |
                      ( 3UL << (2* 8)) |
                      ( 3UL << (2* 9))  );     /* 100 MHz Fast speed          */
  GPIOF->OTYPER  &= ~(( 1UL << (1* 7)) |
                      ( 1UL << (1* 8)) |
                      ( 1UL << (1* 9))  );     /* Output push-pull            */
  GPIOF->PUPDR   &= ~(( 3UL << (2* 7)) |
                      ( 3UL << (2* 8)) |
                      ( 3UL << (2* 9))  );     /* No pull-up, pull-down       */

