Linn39403/STM32NES/stm32nes/Src/GLCD_SPI_STM32F429I.c
  // Configure SPI5
  RCC->APB2ENR |=  RCC_APB2ENR_SPI5EN;         /* Enable SPI Clock            */

  RCC->APB2RSTR |=  RCC_APB2RSTR_SPI5RST;      /* Reset SPI Peripheral        */
  __NOP(); __NOP(); __NOP(); __NOP();
  RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI5RST;

  SPI5->CR1  = (( 0UL <<  15) |          /* 2-line unidirectional data mode   */
	              ( 0UL <<  13) |          /* CRC calculation disabled          */
	              ( 0UL <<  11) |          /* 8-bit data frame format           */
	              ( 1UL <<   9) |          /* Software slave management enabled */
	              ( 1UL <<   8) |          /* Internal slave select             */
	              ( 0UL <<   7) |          /* MSB transmitted first             */
	              ( 2UL <<   3) |          /* Baud rate  5MHz @ 42MHz PCLK1     */
	              ( 1UL <<   2) |          /* Master configuration              */
	              ( 0UL <<   1) |          /* Clock polarity 0                  */
                ( 0UL <<   0)  );        /* Clock phase 0                     */
  SPI5->CR1 |=  SPI_CR1_SPE;             /* Enable SPI                        */

  wr_cmd(0x01);  // SW Reset
  delay(10);
  wr_cmd(0x28);  // Display OFF

  wr_cmd (0xCF); // Power control B (CFh)
  wr_dat(0x00);
  wr_dat(0xC1);
  wr_dat(0x30);

  wr_cmd (0xED); // Power on sequence control (EDh)
  wr_dat(0x64);
  wr_dat(0x03);
  wr_dat(0x12);
  wr_dat(0x81);

  wr_cmd (0xE8); // Driver timing control A (E8h)
  wr_dat(0x85);
  wr_dat(0x00);
  wr_dat(0x78);

  wr_cmd (0xCB); // Power control A (CBh)
  wr_dat(0x39);
  wr_dat(0x2C);
  wr_dat(0x00);
  wr_dat(0x34);
  wr_dat(0x02);

  wr_cmd (0xF7); // Pump ratio control (F7h)
  wr_dat(0x20);

  wr_cmd (0xEA); // Driver timing control B (EAh)
  wr_dat(0x00);
  wr_dat(0x00);

  wr_cmd (0xC0); // Power Control 1 (C0h)
  wr_dat(0x10);

  wr_cmd (0xC1); // Power Control 2 (C1h)
  wr_dat(0x10);

  wr_cmd (0xC5); // VCOM Control 1(C5h)
  wr_dat(0x45);
  wr_dat(0x15);

  wr_cmd (0xC7); // VCOM Control 2(C7h)
  wr_dat(0x90);

  wr_cmd (0x36); // Memory Access Control (36h)
#if (LANDSCAPE == 1)
  wr_dat(0x68);
#else
  wr_dat(0xC8);
#endif

  wr_cmd (0x3A); // Pixel Format Set (3Ah)
  wr_dat(0x55);

  wr_cmd (0xB1); // Frame Rate Control (B1h)
  wr_dat(0x00);
  wr_dat(0x1B);

  wr_cmd (0xF2); // Enable 3G (F2h)
  wr_dat(0x00);

  wr_cmd (0x26); // Gamma Set (26h)
  wr_dat(0x01);

  wr_cmd (0xE0); // Positive Gamma Correction (E0h)
  wr_dat(0x0F);
  wr_dat(0x29);
  wr_dat(0x24);
  wr_dat(0x0C);
  wr_dat(0x0E);
  wr_dat(0x09);
  wr_dat(0x4E);
  wr_dat(0x78);
  wr_dat(0x3C);
  wr_dat(0x09);
  wr_dat(0x13);
  wr_dat(0x05);
  wr_dat(0x17);
  wr_dat(0x11);
  wr_dat(0x00);

  wr_cmd (0xE1); // Negative Gamma Correction (E1h)
  wr_dat(0x00);
  wr_dat(0x16);
  wr_dat(0x1B);
  wr_dat(0x04);
  wr_dat(0x11);
  wr_dat(0x07);
  wr_dat(0x31);
  wr_dat(0x33);
  wr_dat(0x42);
  wr_dat(0x05);
  wr_dat(0x0C);
  wr_dat(0x0A);
  wr_dat(0x28);
  wr_dat(0x2F);
  wr_dat(0x0F);

  wr_cmd (0x2A); // Column Address Set (2Ah)
  wr_dat(0x00);
  wr_dat(0x00);
  wr_dat(0x00);
  wr_dat(0xEF);

  wr_cmd (0x2B); // Page Address Set (2Bh)
  wr_dat(0x00);
  wr_dat(0x00);
  wr_dat(0x01);
  wr_dat(0x3F);

  wr_cmd(0xB7);  // Entry Mode Set (B7h)
  wr_dat(0x07);

  wr_cmd (0xB6); // Display Function Control (B6h)
  wr_dat(0x0A);
  wr_dat(0xA7);
  wr_dat(0x27);
  wr_dat(0x04);

  wr_cmd (0x11); // Sleep Out (11h)
  delay(200);
  wr_cmd (0x29); // Display ON (29h)
  delay(200);

  wr_cmd (0x2C); // Memory Write (2Ch)

}


/*******************************************************************************
* Set draw window region                                                       *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*                   w:        window width in pixel                            *
*                   h:        window height in pixels                          *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_SetWindow (unsigned int x, unsigned int y, unsigned int w, unsigned int h) {

  wr_cmd (0x2A); // Column Address Set (2Ah)
  wr_dat(((x    ) >> 8) & 0xFF);
  wr_dat(((x    )     ) & 0xFF);
  wr_dat(((x+w-1) >> 8) & 0xFF);
  wr_dat(((x+w-1)     ) & 0xFF);

  wr_cmd (0x2B); // Page Address Set (2Bh)
  wr_dat(((y    ) >> 8) & 0xFF);
  wr_dat(((y    )     ) & 0xFF);
  wr_dat(((y+h-1) >> 8) & 0xFF);
  wr_dat(((y+h-1)     ) & 0xFF);

  wr_cmd (0x2C); // Memory Write (2Ch)
}


/*******************************************************************************
* Set draw window region to whole screen                                       *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_WindowMax (void) {
  GLCD_SetWindow (0, 0, WIDTH, HEIGHT);
}


/*******************************************************************************
* Draw a pixel in foreground color                                             *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_PutPixel (unsigned int x, unsigned int y) {

  GLCD_SetWindow(x, y, 1, 1);
  wr_cmd(0x3C); // Write Memory Continue (3Ch)
  wr_dat_start();
  wr_dat_only(Color[TXT_COLOR]);
  wr_dat_stop();
}


/*******************************************************************************
* Set foreground color                                                         *
*   Parameter:      color:    foreground color                                 *
*   Return:                                                                    *
*******************************************************************************/

